ASSIGNMENT 23.02.2023/ PANDAS-BASICS

In [3]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
l1=[4, 8, 15, 16, 23,42]
a=pd.Series(l1)
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#  variable print it.
l2=[1,2,1,1,5,'apple','bat','cat',3.14,'$']
b=pd.Series(l2)
print(b)

0        1
1        2
2        1
3        1
4        5
5    apple
6      bat
7      cat
8     3.14
9        $
dtype: object

In [14]:
# Q3. Create a Pandas DataFrame that contains the following data:
my_data=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]
my_column=['Name','Age','Gender']
table=pd.DataFrame( data=my_data,columns=my_column)
print(table)
type(table)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

In [21]:
# # Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
# DataFrame is a 2 dimensional type of data structure with diffrent typs of columns where as the panda series 1 dimensional
# array that can hold any type of data
import pandas as pd
s = pd.Series([1, 2, 3, 4, 5])  # here i have filled one type of data with 1 dimensional array
df = pd.DataFrame({
    'name': ['sneha','rohan','salman'],
    'age': [25, 30, 35 ],                 #here the data is 2 dimensional
    'gender': ['F', 'M', 'M']
})
print(s,type(s)) # if they are print together
print(df,type(df))

0    1
1    2
2    3
3    4
4    5
dtype: int64 <class 'pandas.core.series.Series'>
     name  age gender
0   sneha   25      F
1   rohan   30      M
2  salman   35      M <class 'pandas.core.frame.DataFrame'>

In [27]:
#  Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

#  head(),tail(),fillna(),drop()  are the some fns
# head():it is used when we want to consider and print first 5 rows or first n rows of the the table
# tail():it is used when we wantto  consider and print last 5 rows or last n rows of the the table
print(table.head(1)) # trying to print first row
print(table.tail(1)) #trying to print last row

    Name  Age  Gender
0  Alice   25  Female
     Name  Age  Gender
2  Claire   27  Female

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# ans: the  Series, DataFrame are mutable in nature unlike panel which is immutable

In [30]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
name = pd.Series(['rahul', 'tanvir','salman', 'siddiq'])
age = pd.Series([25,26,27,29])
gender = pd.Series(['M', 'M', 'M', 'M'])
location=pd.Series(['mysore','mysore','bangalore','dubai'])
df = pd.DataFrame({'Name': name,'Age': age,'Gender': gender,'location':location})
df

     Name  Age Gender   location
0   rahul   25      M     mysore
1  tanvir   26      M     mysore
2  salman   27      M  bangalore
3  siddiq   29      M      dubai